# LinkConversionData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkConversionData Class
Members See Also
---
This class contains the information necessary to re-create a Revit document from an external source.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class LinkConversionData : IDisposable
```

Visual Basic
---
```text
Public Class LinkConversionData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LinkConversionData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LinkConversionData
# See Also
LinkConversionData Members
Autodesk.Revit.DB Namespace